Repository: ntbnaren7/wi4ed-intelligence-mobile-app
Catalog: lib/l10n/app_*.arb
Languages: ta

# loginTitle
source: Welcome Back
ta: மீண்டும் வருக

# loginSubtitle
source: Sign in to monitor your electrical systems
ta: மின் அமைப்புகளை கண்காணிக்க உள்நுழையவும்

# emailLabel
source: Email Address
ta: மின்னஞ்சல் முகவரி

# passwordLabel
source: Password
ta: கடவுச்சொல்

# loginButton
source: Login
ta: உள்நுழைய

source: Forgot Password?
ta: கடவுச்சொல்லை மறந்துவிட்டீர்களா?

# homeTab
source: Home
ta: முகப்பு

# appliancesTab
source: Appliances
ta: சாதனங்கள்

# alertsTab
source: Alerts
ta: எச்சரிக்கைகள்

# settingsTab
source: Settings
ta: அமைப்புகள்

source: Device Status
ta: சாதன நிலை

source: Connection
ta: இணைப்பு

source: Notifications
ta: அறிவிப்புகள்

source: Advanced
ta: மேம்பட்டவை

source: About
ta: பற்றி

source: Language
ta: மொழி

# changeLanguage
source: Change App Language
ta: செயலி மொழியை மாற்றவும்

# loadingSystem
source: Initializing System...
ta: அமைப்பு தொடங்குகிறது...

# connectingToEdge
source: Connecting to Edge Device...
ta: எட்ஜ் சாதனத்துடன் இணைகிறது...

# syncingData
source: Syncing Telemetry...
ta: தரவு ஒத்திசைக்கப்படுகிறது...

source: Total Live Power
ta: மொத்த மின் பயன்பாடு

source: System Normal
ta: அமைப்பு இயல்பாக உள்ளது

source: Anomaly Detected
ta: முரண்பாடு கண்டறியப்பட்டது

source: Quick Actions
ta: விரைவான செயல்கள்

source: View All Appliances
ta: அனைத்து சாதனங்கள்

# registerDevice
source: Register New Device
ta: புதிய சாதனத்தை பதிவு செய்

source: Logout
ta: வெளியேறு

source: Select Language
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: Wi-Fi Network
ta: வைஃபை நெட்வொர்க்

source: Connected to
ta: இணைக்கப்பட்டுள்ளது

source: Cloud Sync
ta: கிளவுட் ஒத்திசைவு

# realTimeSync
source: Real-time data sync enabled
ta: நிகழ்நேர தரவு ஒத்திசைவு இயக்கப்பட்டது

source: Push Notifications
ta: புஷ் அறிவிப்புகள்

# receiveAlerts
source: Receive alerts on this device
ta: இந்த சாதனத்தில் அறிவிப்புகளைப் பெறவும்

source: Critical Alerts Only
ta: முக்கியமான விழிப்பூட்டல்கள் மட்டும்

# onlyCritical
source: Only notify for critical issues
ta: முக்கியமான சிக்கல்களுக்கு மட்டுமே அறிவிக்கவும்

source: Waveform Preview
ta: அலைவடிவ முன்னோட்டம்

# showRawWaveforms
source: Show raw voltage/current waveforms
ta: மூல மின்னழுத்தம்/மின்னோட்ட அலைவடிவங்களைக் காட்டு

source: Debug Mode
ta: பிழைத்திருத்த முறை

# enableLogging
source: Enable diagnostic logging
ta: கண்டறியும் பதிவை இயக்கவும்

source: Reset Device
ta: சாதனத்தை மீட்டமை

# factoryReset
source: Factory reset WI4ED device
ta: WI4ED சாதனத்தை தொழிற்சாலை மீட்டமை

source: Help & Support
ta: உதவி & ஆதரவு

# faqContact
source: FAQ and contact support
ta: FAQ மற்றும் தொடர்பு ஆதரவு

source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

# dataHandling
source: How we handle your data
ta: உங்கள் தரவை நாங்கள் எவ்வாறு கையாளுகிறோம்

source: Cancel
ta: ரத்துசெய்

# confirmReset
source: This will reset all device settings and signatures. This action cannot be undone.
ta: இது எல்லா சாதன அமைப்புகளையும் கையொப்பங்களையும் மீட்டமைக்கும். இந்தச் செயலைச் செயல்தவிர்க்க முடியாது.

source: Reset
ta: மீட்டமை

source: Firmware Version
ta: நிலைபொருள் பதிப்பு

source: Device ID
ta: சாதனத்தின் அடையாள எண்

source: Sync Status
ta: ஒத்திசைவு நிலை

source: Sampling Rate
ta: மாதிரி விகிதம்

source: Locked
ta: பூட்டப்பட்டது

source: Unlocked
ta: திறக்கப்பட்டது
